nradulovic/neon-v2/variant/board/pic32mx_clicker/board.c
/*
 * Neon
 * Copyright (C) 2018   REAL-TIME CONSULTING
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published by the Free
 * Software Foundation, either version 3 of the License, or (at your option)
 * any later version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE.  See the GNU Lesser General Public License for
 * more details.
 *
 * You should have received a copy of the GNU Lesser General Public License along
 * with this program. If not, see <http://www.gnu.org/licenses/>.
 */

#include "board_variant/board.h"
#include "neon_uart.h"
#include "pic32_common.h"
#include "pic32_isr.h"
#include "pic32_uart.h"
#include "pic32_osc.h"
#include <sys/attribs.h>
#include <xc.h>

#define CONCAT_(a, b)                   a ## b
#define CONCAT(a, b)                    CONCAT_(a, b)

#define PIC32MX_CLICKER_BOARD_CONFIG(device)                                \
        CONCAT(device, _board_config)

// PIC32MX534F064H Configuration Bit Settings

// 'C' source line config statements

// DEVCFG3
#pragma config USERID = 0xFFFF          // Enter Hexadecimal value (Enter Hexadecimal value)
#pragma config FSRSSEL = PRIORITY_7     // SRS Select (SRS Priority 7)
#pragma config FCANIO = ON              // CAN I/O Pin Select (Default CAN I/O)
#pragma config FUSBIDIO = OFF           // USB USID Selection (Controlled by Port Function)
#pragma config FVBUSONIO = OFF          // USB VBUS ON Selection (Controlled by Port Function)

// DEVCFG2
#pragma config FPLLIDIV = DIV_2         // PLL Input Divider (2x Divider)
#pragma config FPLLMUL = MUL_20         // PLL Multiplier (20x Multiplier)
#pragma config UPLLIDIV = DIV_2         // USB PLL Input Divider (2x Divider)
#pragma config UPLLEN = ON              // USB PLL Enable (Enabled)
#pragma config FPLLODIV = DIV_1         // System PLL Output Clock Divider (PLL Divide by 1)

// DEVCFG1
#pragma config FNOSC = PRI              // Oscillator Selection Bits (Primary Osc (XT,HS,EC))
#pragma config FSOSCEN = ON             // Secondary Oscillator Enable (Enabled)
#pragma config IESO = ON                // Internal/External Switch Over (Enabled)
#pragma config POSCMOD = HS             // Primary Oscillator Configuration (HS osc mode)
#pragma config OSCIOFNC = OFF           // CLKO Output Signal Active on the OSCO Pin (Disabled)
#pragma config FPBDIV = DIV_1           // Peripheral Clock Divisor (Pb_Clk is Sys_Clk/1)
#pragma config FCKSM = CSECMD           // Clock Switching and Monitor Selection (Clock Switch Enable, FSCM Disabled)
#pragma config WDTPS = PS1048576        // Watchdog Timer Postscaler (1:1048576)
#pragma config FWDTEN = OFF             // Watchdog Timer Enable (WDT Disabled (SWDTEN Bit Controls))

// DEVCFG0
#pragma config DEBUG = OFF              // Background Debugger Enable (Debugger is disabled)
#pragma config ICESEL = ICS_PGx2        // ICE/ICD Comm Channel Select (ICE EMUC2/EMUD2 pins shared with PGC2/PGD2)
#pragma config PWP = OFF                // Program Flash Write Protect (Disable)
#pragma config BWP = OFF                // Boot Flash Write Protect bit (Protection Disabled)
#pragma config CP = OFF                 // Code Protect (Protection Disabled)


#if (PIC32MX_CLICKER_USE_UART == 1)
const struct pic32_uart_board_config 
        PIC32MX_CLICKER_BOARD_CONFIG(PIC32MX_CLICKER_UART) =
{
    .e_isr_prio = 1,
    .rx_isr_prio = 2,
    .tx_isr_prio = 3
};

void __ISR(_UART_5_VECTOR, ipl1AUTO) isr_pic32_mx_clicker_uart(void)
{
    pic32_uart_isr_handler(&PIC32MX_CLICKER_UART);
}
#endif

void nboard_init(void)
{
    /* Setup clocks, phase 1 */
    /* After boot default system clock is set to PRI oscillator by 
     * configuration bits. 
     */
    g_osc_sysclk = PIC32MX_CLICKER_EXT_CLOCK;
    g_osc_pbclk = PIC32MX_CLICKER_EXT_CLOCK;
    SYSKEY = 0x0;
    SYSKEY = 0xAA996655;
    SYSKEY = 0x556699AA;
    OSCCONbits.NOSC = 0x3u; /*  Primary Oscillator with PLL module (XTPLL, HSPLL or ECPLL) */
    OSCCONbits.OSWEN = 1u;
    SYSKEY = 0x0;
    while (OSCCONbits.OSWEN == 1);
    g_osc_sysclk = 80000000ul;
    g_osc_pbclk = 80000000ul;
    
    /* Setup UART if used */
#if (PIC32MX_CLICKER_USE_UART == 1)
    nuart_init(&PIC32MX_CLICKER_UART, NULL);
    nuart_control(
            &PIC32MX_CLICKER_UART, 
            PIC32MX_CLICKER_UART_CONTROL, 
            PIC32MX_CLICKER_UART_BAUDRATE);
#endif
    
}